In [1]:
import re

In [2]:
import pandas as pd

In [3]:
x = pd.ExcelFile('me.xlsx')

In [4]:
x.sheet_names

['Sheet1']

In [5]:
xls = pd.read_excel(x,'Sheet1')

In [6]:
xls.head()

,District,AC name,Village,Sum of # ApplicantName,Task assigned,booth
0,Jalna,Ralegaon (St),SAWARGAON,124,Akash,"Bhokardan264, Partur25, Partur309, Jalna268, J..."
1,Jalna,Sindkhed Raja,KONAD,54,Akash,"Bhokardan131, Bhokardan132"
2,Kolhapur,Alibag,NAGAON,150,Akash,"Kolhapur South314,Kolhapur South315,Nandurbar ..."
3,Latur,Hingna,KHADGAON,21,Akash,"Latur City28,Latur City29,Latur City30"
4,Latur,Kinwat,PATODA BK,161,Akash,"Udgir (Sc)28, Udgir (Sc)29, Udgir (Sc)43"

In [116]:
df = pd.read_csv('100wale.csv')

In [117]:
r = pd.DataFrame(df.groupby('acname')['boothno'].apply(','.join))

In [118]:
r =r.reset_index()

In [9]:
xls.head()

,District,District Name (cleaned),Taluka,Taluka cleaned,Village,Booth
0,Jalgaon,jalgaon,Dharangaon,dharangaon,Dharangaon,Jamner276
1,Jalgaon,jalgaon,Pachora,pachora,Nagardeola,"Pachora202,Pachora203,Pachora204,Pachora205,Pa..."
2,Jalgaon,jalgaon,Bhadgaon,bhadgaon,Aamadde,"Erandol239,Erandol240,Erandol241,Erandol242"
3,Jalgaon,jalgaon,Pachora,pachora,Nandra,"Jamner154,Jamner155, Jamner116,Jamner117\n"
4,Jalgaon,jalgaon,Pachora,pachora,Pimpalgaon Hareshwar,"Pachora293,Pachora294,Pachora296,Pachora297,Pa..."

In [60]:
r.to_csv('booth_file.csv')

In [95]:
xls.head()

,District,Taluka,Village,Count of ApplicantName,Booths,Booth1,Booth2,Booth3,Booth4,Booth5,boothno,acname
0,Ratnagiri,CHIPLUN,Kalvende,136,"Guhagar197,Guhagar198","Guhagar197,Guhagar198",NaN,NaN,NaN,NaN,"[197, 198]",[Guhagar]
1,Ratnagiri,KHED,Bhelsai,116,Guhagar138 Guhagar185,Guhagar138,Guhagar185,NaN,NaN,NaN,"[138, 185]",[Guhagar]
2,Ratnagiri,RATNAGIRI,Pawas,162,Ratnagiri319 Ratnagiri323 Ratnagiri324 Ratnagi...,Ratnagiri319 Ratnagiri323 ...,NaN,NaN,Ratnagiri321,Ratnagiri320,"[319, 323, 324, 321, 320]",[Ratnagiri]
3,Sangli,ATPADI,Nelkaranji,118,"Khanapur222,Khanapur223,Khanapur224","Khanapur222,Khanapur223,Khanapur224",NaN,NaN,NaN,NaN,"[222, 223, 224]",[Khanapur]
4,Sangli,ATPADI,PIMPRIKURDE,140,"Khanapur332,Khanapur333 Khanapur205,Khanapur206","Khanapur332,Khanapur333",NaN,"Khanapur205,Khanapur206",NaN,NaN,"[332, 333, 205, 206]",[Khanapur]

In [106]:
df = xls.set_index(['District','Taluka','Village','Count of ApplicantName']).Booths.str.split(',',expand = True).stack()

In [107]:
df = df.reset_index()

In [38]:
xls.head()

,District,District Name (cleaned),Taluka,Taluka cleaned,Village,Booth,boothno,acname
0,Jalgaon,jalgaon,Dharangaon,dharangaon,Dharangaon,Jamner276,[276],Jamner276
1,Jalgaon,jalgaon,Pachora,pachora,Nagardeola,"Pachora202,Pachora203,Pachora204,Pachora205,Pa...","[202, 203, 204, 205, 206, 207, 208, 209, 210, ...","Pachora202,Pachora203,Pachora204,Pachora205,Pa..."
2,Jalgaon,jalgaon,Bhadgaon,bhadgaon,Aamadde,"Erandol239,Erandol240,Erandol241,Erandol242","[239, 240, 241, 242]","Erandol239,Erandol240,Erandol241,Erandol242"
3,Jalgaon,jalgaon,Pachora,pachora,Nandra,"Jamner154,Jamner155, Jamner116,Jamner117\n","[154, 155, 116, 117]","Jamner154,Jamner155, Jamner116,Jamner117\n"
4,Jalgaon,jalgaon,Pachora,pachora,Pimpalgaon Hareshwar,"Pachora293,Pachora294,Pachora296,Pachora297,Pa...","[293, 294, 296, 297, 298, 299, 300, 301, 198, ...","Pachora293,Pachora294,Pachora296,Pachora297,Pa..."

AttributeError: 'str' object has no attribute 'dtype'

In [61]:
y = xls.Booth[1]

In [12]:
l = re.findall("([0-9]+)", y)

In [62]:
li = list(set(re.sub('[0-9]+','', y).split(',')))

In [77]:
list(set(li.split(',')))

['Pachora']

In [100]:
df.to_csv('wale200.csv')

In [149]:
xls.to_csv('50wala.csv')

In [9]:
xls.head()

,District,AC name,Village,Sum of # ApplicantName,Task assigned,booth
0,Jalna,Ralegaon (St),SAWARGAON,124,Akash,"Bhokardan264, Partur25, Partur309, Jalna268, J..."
1,Jalna,Sindkhed Raja,KONAD,54,Akash,"Bhokardan131, Bhokardan132"
2,Kolhapur,Alibag,NAGAON,150,Akash,"Kolhapur South314,Kolhapur South315,Nandurbar ..."
3,Latur,Hingna,KHADGAON,21,Akash,"Latur City28,Latur City29,Latur City30"
4,Latur,Kinwat,PATODA BK,161,Akash,"Udgir (Sc)28, Udgir (Sc)29, Udgir (Sc)43"

In [10]:
xls.booth = xls.booth.astype(str)

In [11]:
xls['boothno'] = xls.booth.map(lambda x: re.findall("([0-9]+)", x))

In [12]:
xls['acname'] = xls.booth.map(lambda x : list(set(re.sub('[0-9]+','', x).split(','))))

In [13]:
xls.head()

,District,AC name,Village,Sum of # ApplicantName,Task assigned,booth,boothno,acname
0,Jalna,Ralegaon (St),SAWARGAON,124,Akash,"Bhokardan264, Partur25, Partur309, Jalna268, J...","[264, 25, 309, 268, 269, 270, 113]","[ Partur, Jalna, Bhokardan]"
1,Jalna,Sindkhed Raja,KONAD,54,Akash,"Bhokardan131, Bhokardan132","[131, 132]","[ Bhokardan, Bhokardan]"
2,Kolhapur,Alibag,NAGAON,150,Akash,"Kolhapur South314,Kolhapur South315,Nandurbar ...","[314, 315, 173, 102, 211, 212]","[Kolhapur South, Islampur, Mahad, Nandurbar (St)]"
3,Latur,Hingna,KHADGAON,21,Akash,"Latur City28,Latur City29,Latur City30","[28, 29, 30]",[Latur City]
4,Latur,Kinwat,PATODA BK,161,Akash,"Udgir (Sc)28, Udgir (Sc)29, Udgir (Sc)43","[28, 29, 43]","[Udgir (Sc), Udgir (Sc)]"

In [14]:
xls['f'] = xls.acname.map(lambda x : len(x))

In [15]:
xls.to_csv('gg2.csv')

In [67]:
tehsil = pd.read_csv('Delimitation_MH.csv')

In [68]:
r = pd.DataFrame(tehsil.groupby('Ac Name')['Local Body Name'].apply(','.join))

In [69]:
r = r.reset_index()

In [34]:
df.head()

,District Clean,Taluka,Village,Beneficaries,Tag,level_5,0
0,Ahmednagar,NAGAR,Agadagaon,242,Ahmednagar_Agadagaon,0,Rahuri184
1,Ahmednagar,NAGAR,Agadagaon,242,Ahmednagar_Agadagaon,1,Rahuri185
2,Ahmednagar,NAGAR,Agadagaon,242,Ahmednagar_Agadagaon,2,Shirdi108
3,Ahmednagar,NAGAR,Agadagaon,242,Ahmednagar_Agadagaon,3,Shirdi109
4,Ahmednagar,NAGAR,Agadagaon,242,Ahmednagar_Agadagaon,4,Shirdi107

In [28]:
df = pd.DataFrame(df)

In [33]:
df = df.reset_index()

In [38]:
df['boothno'] = df[0].map(lambda x: re.findall("([0-9]+)", x))

IndexError: list index out of range

In [39]:
df['acname'] = df[0].map(lambda x : list(set(re.findall('[a-zA-Z]+', x)))[0])

In [113]:
df.to_csv('100wale.csv')